MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/rtcc/processor/rtcc_p32mx695f512h.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _RTCC_P32MX695F512H_H
#define _RTCC_P32MX695F512H_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    RTCC_ID_0 = 0,
    RTCC_NUMBER_OF_MODULES

} RTCC_MODULE_ID;

typedef enum {

    RTCC_ALARM_EVERY_HALF_SECOND = 0x00,
    RTCC_ALARM_EVERY_SECOND = 0x01,
    RTCC_ALARM_EVERY_10_SECONDS = 0x02,
    RTCC_ALARM_EVERY_MINUTE = 0x03,
    RTCC_ALARM_EVERY_10_MINUTES = 0x04,
    RTCC_ALARM_EVERY_HOUR = 0x05,
    RTCC_ALARM_ONCE_A_DAY = 0x06,
    RTCC_ALARM_ONCE_A_WEEK = 0x07,
    RTCC_ALARM_ONCE_A_MONTH = 0x08,
    RTCC_ALARM_ONCE_A_YEAR = 0x09

} RTCC_ALARM_MASK_CONFIGURATION;

typedef enum {

    RTCC_OUTPUT_ALARM_PULSE = 0x00,
    RTCC_OUTPUT_SECONDS_CLOCK = 0x01

} RTCC_OUTPUT_SELECT;

typedef enum {

    RTCC_CLOCK_SOURCE_SELECT_NONE

} RTCC_CLOCK_SOURCE_SELECT;

PLIB_INLINE SFR_TYPE* _RTCC_CALIBRATION_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCCON;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ENABLE_CONTROL_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCCON;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_STOP_IN_IDLE_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCCON;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_OUTPUT_SELECT_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCCON;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_CLOCK_RUNNING_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCCON;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_WRITE_ENABLE_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCCON;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_SYNC_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCCON;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_HALFSEC_STATUS_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCCON;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_OUTPUT_ENABLE_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCCON;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_CONTROL_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCALRM;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_CHIME_CONTROL_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCALRM;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_PULSE_INITIAL_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCALRM;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_SYNC_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCALRM;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_MASK_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCALRM;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_REPEAT_COUNTER_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCALRM;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_TIME_HR10_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCTIME;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_TIME_HR01_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCTIME;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_TIME_MIN10_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCTIME;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_TIME_MIN01_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCTIME;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_TIME_SEC10_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCTIME;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_TIME_SEC01_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCTIME;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

