MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/rtcc/processor/rtcc_p32mx695f512h.h
PLIB_INLINE SFR_TYPE* _RTCC_RTCTIME_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCTIME;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_DATE_YEAR10_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCDATE;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_DATE_YEAR01_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCDATE;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_DATE_MONTH10_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCDATE;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_DATE_MONTH01_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCDATE;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_DATE_DAY10_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCDATE;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_DATE_DAY01_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCDATE;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_DATE_WDAY01_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCDATE;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_RTCDATE_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &RTCDATE;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_HR10_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &ALRMTIME;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_HR01_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &ALRMTIME;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_MIN10_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &ALRMTIME;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_MIN01_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &ALRMTIME;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_SEC10_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &ALRMTIME;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_SEC01_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &ALRMTIME;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_TIME_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &ALRMTIME;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_MONTH10_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &ALRMDATE;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_MONTH01_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &ALRMDATE;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_DAY10_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &ALRMDATE;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_DAY01_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &ALRMDATE;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_WDAY01_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &ALRMDATE;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _RTCC_ALARM_DATE_VREG(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return &ALRMDATE;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_CALIBRATION_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_CAL_MASK;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ENABLE_CONTROL_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_ON_MASK;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_STOP_IN_IDLE_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_SIDL_MASK;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_OUTPUT_SELECT_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_RTSECSEL_MASK;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_CLOCK_RUNNING_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_RTCCLKON_MASK;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

