MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/rtcc/processor/rtcc_p32mx695f512h.h
PLIB_INLINE SFR_DATA _RTCC_ALARM_HR01_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_HR01_MASK;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_MIN10_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_MIN10_MASK;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_MIN01_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_MIN01_MASK;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_SEC10_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_SEC10_MASK;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_SEC01_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_SEC01_MASK;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_TIME_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return (SFR_DATA)-1;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_MONTH10_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMDATE_MONTH10_MASK;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_MONTH01_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMDATE_MONTH01_MASK;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_DAY10_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMDATE_DAY10_MASK;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_DAY01_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMDATE_DAY01_MASK;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_WDAY01_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMDATE_WDAY01_MASK;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_DATE_MASK(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return (SFR_DATA)-1;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_CALIBRATION_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_CAL_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ENABLE_CONTROL_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_ON_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_STOP_IN_IDLE_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_SIDL_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_OUTPUT_SELECT_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_RTSECSEL_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_CLOCK_RUNNING_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_RTCCLKON_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_WRITE_ENABLE_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_RTCWREN_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_SYNC_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_RTCSYNC_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_HALFSEC_STATUS_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_HALFSEC_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_OUTPUT_ENABLE_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_RTCOE_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_CONTROL_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCALRM_ALRMEN_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_CHIME_CONTROL_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCALRM_CHIME_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_PULSE_INITIAL_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCALRM_PIV_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

