MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/rtcc/processor/rtcc_p32mx695f512h.h
PLIB_INLINE SFR_DATA _RTCC_ALARM_SYNC_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCALRM_ALRMSYNC_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_MASK_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCALRM_AMASK_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_REPEAT_COUNTER_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCALRM_ARPT_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_TIME_HR10_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCTIME_HR10_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_TIME_HR01_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCTIME_HR01_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_TIME_MIN10_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCTIME_MIN10_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_TIME_MIN01_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCTIME_MIN01_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_TIME_SEC10_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCTIME_SEC10_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_TIME_SEC01_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCTIME_SEC01_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_RTCTIME_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return (SFR_DATA)0;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_DATE_YEAR10_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCDATE_YEAR10_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_DATE_YEAR01_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCDATE_YEAR01_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_DATE_MONTH10_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCDATE_MONTH10_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_DATE_MONTH01_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCDATE_MONTH01_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_DATE_DAY10_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCDATE_DAY10_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_DATE_DAY01_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCDATE_DAY01_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_DATE_WDAY01_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCDATE_WDAY01_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_RTCDATE_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return (SFR_DATA)0;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_HR10_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_HR10_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_HR01_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_HR01_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_MIN10_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_MIN10_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_MIN01_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_MIN01_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_SEC10_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_SEC10_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_SEC01_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_SEC01_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_TIME_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return (SFR_DATA)0;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_MONTH10_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMDATE_MONTH10_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_MONTH01_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMDATE_MONTH01_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_DAY10_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMDATE_DAY10_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_DAY01_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMDATE_DAY01_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_WDAY01_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMDATE_WDAY01_POSITION;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_DATE_POS(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return (SFR_DATA)0;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_CALIBRATION_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_CAL_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ENABLE_CONTROL_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_ON_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_STOP_IN_IDLE_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_SIDL_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_OUTPUT_SELECT_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_RTSECSEL_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_CLOCK_RUNNING_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_RTCCLKON_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_WRITE_ENABLE_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_RTCWREN_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_SYNC_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_RTCSYNC_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

