MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/rtcc/processor/rtcc_p32mx695f512h.h
PLIB_INLINE SFR_DATA _RTCC_HALFSEC_STATUS_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_HALFSEC_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_OUTPUT_ENABLE_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCCON_RTCOE_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_CONTROL_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCALRM_ALRMEN_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_CHIME_CONTROL_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCALRM_CHIME_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_PULSE_INITIAL_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCALRM_PIV_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_SYNC_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCALRM_ALRMSYNC_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_MASK_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCALRM_AMASK_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_REPEAT_COUNTER_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCALRM_ARPT_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_TIME_HR10_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCTIME_HR10_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_TIME_HR01_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCTIME_HR01_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_TIME_MIN10_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCTIME_MIN10_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_TIME_MIN01_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCTIME_MIN01_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_TIME_SEC10_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCTIME_SEC10_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_TIME_SEC01_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCTIME_SEC01_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_RTCTIME_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_DATE_YEAR10_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCDATE_YEAR10_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_DATE_YEAR01_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCDATE_YEAR01_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_DATE_MONTH10_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCDATE_MONTH10_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_DATE_MONTH01_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCDATE_MONTH01_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_DATE_DAY10_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCDATE_DAY10_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_DATE_DAY01_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCDATE_DAY01_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_DATE_WDAY01_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _RTCDATE_WDAY01_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_RTCDATE_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_HR10_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_HR10_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_HR01_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_HR01_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_MIN10_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_MIN10_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_MIN01_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_MIN01_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_SEC10_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_SEC10_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_SEC01_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMTIME_SEC01_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

