MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/rtcc/processor/rtcc_p32mx695f512h.h
PLIB_INLINE SFR_DATA _RTCC_ALARM_TIME_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_MONTH10_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMDATE_MONTH10_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_MONTH01_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMDATE_MONTH01_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_DAY10_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMDATE_DAY10_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_DAY01_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMDATE_DAY01_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_WDAY01_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return _ALRMDATE_WDAY01_LENGTH;
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _RTCC_ALARM_DATE_LEN(RTCC_MODULE_ID i)
{
    switch (i) {
        case RTCC_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/rtcc_EnableControl_Default.h"
#include "../templates/rtcc_WriteEnable_Default.h"
#include "../templates/rtcc_StopInIdle_Default.h"
#include "../templates/rtcc_OutputSelect_Default.h"
#include "../templates/rtcc_ClockSelect_Unsupported.h"
#include "../templates/rtcc_ClockRunning_Default.h"
#include "../templates/rtcc_Calibration_Default.h"
#include "../templates/rtcc_Sync_Default.h"
#include "../templates/rtcc_HalfSecond_Default.h"
#include "../templates/rtcc_OutputControl_Default.h"
#include "../templates/rtcc_AlarmControl_Default.h"
#include "../templates/rtcc_AlarmChimeControl_Default.h"
#include "../templates/rtcc_AlarmPulseInitial_Default.h"
#include "../templates/rtcc_AlarmSync_Default.h"
#include "../templates/rtcc_AlarmMaskControl_Default.h"
#include "../templates/rtcc_AlarmRepeatControl_Default.h"
#include "../templates/rtcc_RTCTime_Default.h"
#include "../templates/rtcc_RTCDate_Default.h"
#include "../templates/rtcc_AlarmTime_Default.h"
#include "../templates/rtcc_AlarmDate_Default.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API void PLIB_RTCC_Enable(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_Enable_Default(index);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_RTCC_Disable(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_Disable_Default(index);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsEnableControl(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsEnableControl_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_RTCC_WriteEnable(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_WriteEnable_Default(index);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_RTCC_WriteDisable(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_WriteDisable_Default(index);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsWriteEnable(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsWriteEnable_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_RTCC_StopInIdleEnable(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_StopInIdleEnable_Default(index);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_RTCC_StopInIdleDisable(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_StopInIdleDisable_Default(index);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsStopInIdleControl(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsStopInIdleControl_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_RTCC_OutputSelect(RTCC_MODULE_ID index, RTCC_OUTPUT_SELECT data)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_OutputSelect_Default(index, data);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsOutputSelect(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsOutputSelect_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_RTCC_ClockSourceSelect(RTCC_MODULE_ID index, RTCC_CLOCK_SOURCE_SELECT source)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_ClockSourceSelect_Unsupported(index, source);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsClockSelect(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsClockSelect_Unsupported(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

