MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/rtcc/processor/rtcc_p32mx695f512h.h
PLIB_INLINE_API bool PLIB_RTCC_ClockRunningStatus(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ClockRunningStatus_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsClockRunning(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsClockRunning_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint16_t PLIB_RTCC_DriftCalibrateGet(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_DriftCalibrateGet_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API void PLIB_RTCC_DriftCalibrateSet(RTCC_MODULE_ID index, uint16_t calibrationbits)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_DriftCalibrateSet_Default(index, calibrationbits);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsCalibration(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsCalibration_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_RTCSyncStatusGet(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_RTCSyncStatusGet_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsSynchronization(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsSynchronization_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_HalfSecondStatusGet(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_HalfSecondStatusGet_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsHalfSecond(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsHalfSecond_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_RTCC_ClockOutputEnable(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_ClockOutputEnable_Default(index);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_RTCC_ClockOutputDisable(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_ClockOutputDisable_Default(index);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsOutputControl(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsOutputControl_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_RTCC_AlarmEnable(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_AlarmEnable_Default(index);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_RTCC_AlarmDisable(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_AlarmDisable_Default(index);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsAlarmControl(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsAlarmControl_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_RTCC_AlarmChimeEnable(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_AlarmChimeEnable_Default(index);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_RTCC_AlarmChimeDisable(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_AlarmChimeDisable_Default(index);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsAlarmChimeControl(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsAlarmChimeControl_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_RTCC_AlarmPulseInitialSet(RTCC_MODULE_ID index, bool data)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_AlarmPulseInitialSet_Default(index, data);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_AlarmPulseInitialGet(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_AlarmPulseInitialGet_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsAlarmPulseInitial(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsAlarmPulseInitial_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_AlarmSyncStatusGet(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_AlarmSyncStatusGet_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsAlarmSynchronization(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsAlarmSynchronization_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_RTCC_AlarmMaskModeSelect(RTCC_MODULE_ID index, RTCC_ALARM_MASK_CONFIGURATION data)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_AlarmMaskModeSelect_Default(index, data);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsAlarmMaskControl(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsAlarmMaskControl_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_RTCC_AlarmRepeatCountSet(RTCC_MODULE_ID index, uint8_t data)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_AlarmRepeatCountSet_Default(index, data);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint8_t PLIB_RTCC_AlarmRepeatCountGet(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_AlarmRepeatCountGet_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsAlarmRepeatControl(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsAlarmRepeatControl_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

