MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/rtcc/processor/rtcc_p32mx695f512h.h
PLIB_INLINE_API uint32_t PLIB_RTCC_AlarmMonthGet(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_AlarmMonthGet_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

PLIB_INLINE_API void PLIB_RTCC_AlarmMonthSet(RTCC_MODULE_ID index, uint32_t month)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_AlarmMonthSet_Default(index, month);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint32_t PLIB_RTCC_AlarmDayGet(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_AlarmDayGet_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

PLIB_INLINE_API void PLIB_RTCC_AlarmDaySet(RTCC_MODULE_ID index, uint32_t day)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_AlarmDaySet_Default(index, day);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint32_t PLIB_RTCC_AlarmWeekDayGet(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_AlarmWeekDayGet_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

PLIB_INLINE_API void PLIB_RTCC_AlarmWeekDaySet(RTCC_MODULE_ID index, uint32_t weekday)
{
    switch (index) {
        case RTCC_ID_0 :
            RTCC_AlarmWeekDaySet_Default(index, weekday);
            break;
        case RTCC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_RTCC_ExistsAlarmDate(RTCC_MODULE_ID index)
{
    switch (index) {
        case RTCC_ID_0 :
            return RTCC_ExistsAlarmDate_Default(index);
        case RTCC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

#endif
